In [1]:
import sqlite3
conn = sqlite3.connect('student.db')
cursor = conn.cursor()
def create_table():
    cursor .execute('''CREATE TABLE student
                    (student_id int primary key,
                    name text,
                    class text, 
                    course_id int, 
                    score float)''')
    cursor.execute('''CREATE TABLE course
                (id int, 
                course_name)''')
create_table()
print('Đã tạo bảng thành công')

Đã tạo bảng thành công

In [3]:
cursor.execute('''INSERT INTO student VALUES
               (1,'Nguyen Minh Hoang','May Tinh',12,6.7),
               (2,'Tran Thi Lan','Kinh Te',34,9.2),
               (3,'Pham Van Nam','Toan Tin',NULL,7.9),
               (4,'Le Thanh Huyen','Toan Tin',20,7.2),
               (5,'Vu Quoc Anh','May Tinh',24,8.0),
               (6,'Dang Thuy Linh','May Tinh',24,5.5),
               (7,'Bui Tien Dung','Kinh Te',34,9.2),
               (8,'Ho Ngoc Mai','Toan Tin',20,8.8),
               (9,'Duong Huu Phuoc','Kinh Te',NULL,7.2),
               (10,'Cao Thi Hanh','May Tinh',NULL,7.0)''')
cursor.execute('''INSERT INTO course VALUES
               (12,'Giai tich'),
               (34,'Thong ke'),
               (26,'Tin hoc')''')
conn.commit()
table_in4 = cursor.execute('SELECT * FROM student')
for i in table_in4:
    print(i)
table_2_in4 = cursor.execute('SELECT * FROM course')
for i in table_2_in4:
    print(i)

(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7)
(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2)
(3, 'Pham Van Nam', 'Toan Tin', None, 7.9)
(4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2)
(5, 'Vu Quoc Anh', 'May Tinh', 24, 8.0)
(6, 'Dang Thuy Linh', 'May Tinh', 24, 5.5)
(7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2)
(8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8)
(9, 'Duong Huu Phuoc', 'Kinh Te', None, 7.2)
(10, 'Cao Thi Hanh', 'May Tinh', None, 7.0)
(12, 'Giai tich')
(34, 'Thong ke')
(26, 'Tin hoc')

# 1.Kết nối hai bảng trên theo những cách sau

## Sử dụng tích Decartes

In [6]:
cursor.execute('''SELECT *
                from student, course''')
for i in cursor:
    print(i)

(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 12, 'Giai tich')
(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 34, 'Thong ke')
(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 26, 'Tin hoc')
(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 12, 'Giai tich')
(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 34, 'Thong ke')
(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 26, 'Tin hoc')
(3, 'Pham Van Nam', 'Toan Tin', None, 7.9, 12, 'Giai tich')
(3, 'Pham Van Nam', 'Toan Tin', None, 7.9, 34, 'Thong ke')
(3, 'Pham Van Nam', 'Toan Tin', None, 7.9, 26, 'Tin hoc')
(4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2, 12, 'Giai tich')
(4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2, 34, 'Thong ke')
(4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2, 26, 'Tin hoc')
(5, 'Vu Quoc Anh', 'May Tinh', 24, 8.0, 12, 'Giai tich')
(5, 'Vu Quoc Anh', 'May Tinh', 24, 8.0, 34, 'Thong ke')
(5, 'Vu Quoc Anh', 'May Tinh', 24, 8.0, 26, 'Tin hoc')
(6, 'Dang Thuy Linh', 'May Tinh', 24, 5.5, 12, 'Giai tich')
(6, 'Dang Thuy Linh', 'May Tinh', 24, 5.5, 34, 'Thong ke')
(6, 'Dang Thuy Linh', 'May Tinh', 24, 5.5, 26, 'Tin hoc')
(7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 12, 'Giai tich')
(7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 34, 'Thong ke')
(7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 26, 'Tin hoc')
(8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8, 12, 'Giai tich')
(8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8, 34, 'Thong ke')
(8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8, 26, 'Tin hoc')
(9, 'Duong Huu Phuoc', 'Kinh Te', None, 7.2, 12, 'Giai tich')
(9, 'Duong Huu Phuoc', 'Kinh Te', None, 7.2, 34, 'Thong ke')
(9, 'Duong Huu Phuoc', 'Kinh Te', None, 7.2, 26, 'Tin hoc')
(10, 'Cao Thi Hanh', 'May Tinh', None, 7.0, 12, 'Giai tich')
(10, 'Cao Thi Hanh', 'May Tinh', None, 7.0, 34, 'Thong ke')
(10, 'Cao Thi Hanh', 'May Tinh', None, 7.0, 26, 'Tin hoc')

## Sử dụng JOIN

### Join

In [10]:
cursor.execute('''select * from 
               student join course
               on student.course_id = course.id''')
for i in cursor:
    print(i)

(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 12, 'Giai tich')
(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 34, 'Thong ke')
(7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 34, 'Thong ke')

### LEFT JOIN

In [11]:
cursor.execute('''SELECT * FROM 
               student LEFT JOIN course
               on student.course_id = course.id''')
for i in cursor:
    print(i)

(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 12, 'Giai tich')
(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 34, 'Thong ke')
(3, 'Pham Van Nam', 'Toan Tin', None, 7.9, None, None)
(4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2, None, None)
(5, 'Vu Quoc Anh', 'May Tinh', 24, 8.0, None, None)
(6, 'Dang Thuy Linh', 'May Tinh', 24, 5.5, None, None)
(7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 34, 'Thong ke')
(8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8, None, None)
(9, 'Duong Huu Phuoc', 'Kinh Te', None, 7.2, None, None)
(10, 'Cao Thi Hanh', 'May Tinh', None, 7.0, None, None)

### RIGHT JOIN

In [13]:
cursor.execute('''SELECT * FROM 
               student right JOIN course
               on student.course_id = course.id''')
for i in cursor:
    print(i)

(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 12, 'Giai tich')
(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 34, 'Thong ke')
(7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 34, 'Thong ke')
(None, None, None, None, None, 26, 'Tin hoc')

# Cập nhật những giá trị course_id còn thiếu trong bảng student , trong đó các giá trị được điền là những giá trị nằm trong bảng course.

In [22]:
cursor.execute('''UPDATE student
               SET course_id = (SELECT id FROM course ORDER BY RANDOM() LIMIT 1)
                WHERE course_id IS NULL;
               ''')

cursor.execute('''select  * from student''')
for i in cursor:
    print(i)

(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7)
(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2)
(3, 'Pham Van Nam', 'Toan Tin', 34, 7.9)
(4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2)
(5, 'Vu Quoc Anh', 'May Tinh', 24, 8.0)
(6, 'Dang Thuy Linh', 'May Tinh', 24, 5.5)
(7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2)
(8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8)
(9, 'Duong Huu Phuoc', 'Kinh Te', 34, 7.2)
(10, 'Cao Thi Hanh', 'May Tinh', 34, 7.0)

## a. Tổng số sinh viên, điểm trung bình của từng lớp

In [27]:
cursor.execute('''SELECT class, COUNT(name) as tong_sv,avg(score) as diem_tb
               from student 
               group by class''')
for i in cursor:
    print(i)

('Kinh Te', 3, 8.533333333333333)
('May Tinh', 4, 6.8)
('Toan Tin', 3, 7.966666666666668)

## b.Tổng số sinh viên điểm trung bình của từng môn học

In [29]:
cursor.execute('''select class,course_id, count(name) as tong_sv, avg(score) as diem_tb
               from student 
               group by course_id''')
for i in cursor:
    print(i)

('May Tinh', 12, 1, 6.7)
('Toan Tin', 20, 2, 8.0)
('May Tinh', 24, 2, 6.75)
('Kinh Te', 34, 5, 8.1)

## c. Phân loại thi đua theo điểm số của từng môn học

### i. Điểm TB >= 9.0: Xuất sắc

In [37]:
cursor.execute('''select class,avg(score) as diem_trung_binh,
               CASE
                    WHEN AVG(score)>= 9.0 THEN 'Xuất Sắc'
                    WHEN AVG(score)<=8.9 AND AVG(score)>= 6.0 THEN 'Tốt'
                    ELSE 'Kém'
                END AS Category
               from student
               group by course_id
               having Category = 'Xuất sắc'
               ''')
for i in cursor:
    print(i)

## ii. Điểm TB loại tốt

In [38]:
cursor.execute('''select class,avg(score) as diem_trung_binh,
               CASE
                    WHEN AVG(score)>= 9.0 THEN 'Xuất Sắc'
                    WHEN AVG(score)<=8.9 AND AVG(score)>= 6.0 THEN 'Tốt'
                    ELSE 'Kém'
                END AS Category
               from student
               group by course_id
               having Category = 'Tốt'
               ''')
for i in cursor:
    print(i)

('May Tinh', 6.7, 'Tốt')
('Toan Tin', 8.0, 'Tốt')
('May Tinh', 6.75, 'Tốt')
('Kinh Te', 8.1, 'Tốt')

## ii.Điểm TB loại Kém

In [39]:
cursor.execute('''select class,avg(score) as diem_trung_binh,
               CASE
                    WHEN AVG(score)>= 9.0 THEN 'Xuất Sắc'
                    WHEN AVG(score)<=8.9 AND AVG(score)>= 6.0 THEN 'Tốt'
                    ELSE 'Kém'
                END AS Category
               from student
               group by course_id
               having Category = 'Kém'
               ''')
for i in cursor:
    print(i)

# Xếp loại sinh viên thông qua

## a. Điểm số

In [59]:
cursor.execute('''select student_id,name,class, score,ROW_NUMBER() OVER(ORDER BY score desc) as xep_hang
               from student''')
for i in cursor:
    print(i)

(2, 'Tran Thi Lan', 'Kinh Te', 9.2, 1)
(7, 'Bui Tien Dung', 'Kinh Te', 9.2, 2)
(8, 'Ho Ngoc Mai', 'Toan Tin', 8.8, 3)
(5, 'Vu Quoc Anh', 'May Tinh', 8.0, 4)
(3, 'Pham Van Nam', 'Toan Tin', 7.9, 5)
(4, 'Le Thanh Huyen', 'Toan Tin', 7.2, 6)
(9, 'Duong Huu Phuoc', 'Kinh Te', 7.2, 7)
(10, 'Cao Thi Hanh', 'May Tinh', 7.0, 8)
(1, 'Nguyen Minh Hoang', 'May Tinh', 6.7, 9)
(6, 'Dang Thuy Linh', 'May Tinh', 5.5, 10)

## b.Điểm số theo lớp học

In [61]:
cursor.execute('''select student_id,name,class, score,ROW_NUMBER() OVER(PARTITION BY class ORDER BY score desc) as xep_hang
               from student''')
for i in cursor:
    print(i)

(2, 'Tran Thi Lan', 'Kinh Te', 9.2, 1)
(7, 'Bui Tien Dung', 'Kinh Te', 9.2, 2)
(9, 'Duong Huu Phuoc', 'Kinh Te', 7.2, 3)
(5, 'Vu Quoc Anh', 'May Tinh', 8.0, 1)
(10, 'Cao Thi Hanh', 'May Tinh', 7.0, 2)
(1, 'Nguyen Minh Hoang', 'May Tinh', 6.7, 3)
(6, 'Dang Thuy Linh', 'May Tinh', 5.5, 4)
(8, 'Ho Ngoc Mai', 'Toan Tin', 8.8, 1)
(3, 'Pham Van Nam', 'Toan Tin', 7.9, 2)
(4, 'Le Thanh Huyen', 'Toan Tin', 7.2, 3)

## c. Điểm số theo mã môn học

In [62]:
cursor.execute('''select student_id,name,class,course_id, score,ROW_NUMBER() OVER(PARTITION BY course_id ORDER BY score desc) as xep_hang
               from student
               ''')
for i in cursor:
    print(i)

(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 1)
(8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8, 1)
(4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2, 2)
(5, 'Vu Quoc Anh', 'May Tinh', 24, 8.0, 1)
(6, 'Dang Thuy Linh', 'May Tinh', 24, 5.5, 2)
(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 1)
(7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 2)
(3, 'Pham Van Nam', 'Toan Tin', 34, 7.9, 3)
(9, 'Duong Huu Phuoc', 'Kinh Te', 34, 7.2, 4)
(10, 'Cao Thi Hanh', 'May Tinh', 34, 7.0, 5)

### Top 3 Sinh viên đạt thứ hạng cao nhất trong từng trường hợp trên

#### a. Điểm số

In [117]:
cursor.execute('''SELECT student_id,name,class,course_id, score, ROW_NUMBER() OVER ( ORDER BY score desc) 
               FROM student limit 3''')
print('3 sinh viên có thứ hạng cao nhất theo điểm số')
for i in cursor:
    print(i)
print('3 sinh viên có thứ hạng thấp nhất theo điểm số')
cursor.execute('''SELECT student_id,name,class,course_id,score,ROW_NUMBER() OVER (ORDER BY score asc)
               from student limit 3''')
print('\n')
for i in cursor:
    print(i)

3 sinh viên có thứ hạng cao nhất theo điểm số
(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 1)
(7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 2)
(8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8, 3)
3 sinh viên có thứ hạng thấp nhất theo điểm số


(6, 'Dang Thuy Linh', 'May Tinh', 24, 5.5, 1)
(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 2)
(10, 'Cao Thi Hanh', 'May Tinh', 34, 7.0, 3)

#### b. Điểm số theo lớp học

In [118]:
cursor.execute('''SELECT student_id,name,class,course_id, score,rank
               FROM  (
                select student_id,name,class,course_id, score,
                    ROW_NUMBER() OVER (PARTITION BY class ORDER BY score desc) AS rank
               FROM student ) ranked_students  
               where rank <=3 
               ''')
print('3 sinh viên có thứ hạng cao nhất theo lớp học')
for i in cursor:
    print(i)
print('\n')
print('3 sinh viên có thứ hạng thấp nhất theo lớp học')
cursor.execute('''SELECT student_id,name,class,course_id,score,rank
               from (select student_id,name,class, course_id ,score,
                    ROW_NUMBER() OVER (PARTITION BY class ORDER BY score asc) AS rank
               from student)
               where rank <=3''')
for i in cursor:
    print(i)

3 sinh viên có thứ hạng cao nhất theo lớp học
(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 1)
(7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 2)
(9, 'Duong Huu Phuoc', 'Kinh Te', 34, 7.2, 3)
(5, 'Vu Quoc Anh', 'May Tinh', 24, 8.0, 1)
(10, 'Cao Thi Hanh', 'May Tinh', 34, 7.0, 2)
(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 3)
(8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8, 1)
(3, 'Pham Van Nam', 'Toan Tin', 34, 7.9, 2)
(4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2, 3)


3 sinh viên có thứ hạng thấp nhất theo lớp học
(9, 'Duong Huu Phuoc', 'Kinh Te', 34, 7.2, 1)
(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 2)
(7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 3)
(6, 'Dang Thuy Linh', 'May Tinh', 24, 5.5, 1)
(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 2)
(10, 'Cao Thi Hanh', 'May Tinh', 34, 7.0, 3)
(4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2, 1)
(3, 'Pham Van Nam', 'Toan Tin', 34, 7.9, 2)
(8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8, 3)

#### C.Điểm số theo mã môn học

In [125]:
cursor.execute('''select student_id,name,class,course_id,score,rank
               from (select student_id,name,class,course_id,score,
                        ROW_NUMBER() OVER (PARTITION BY course_id ORDER BY score) as rank
               from student) ranked
               where rank <=3 ''')
print('3 sinh viên có thứ hạng cao nhất theo mã môn học')
for i in cursor:
    print(i)

cursor.execute('''select student_id,name,class,course_id,score,rank
               from (select student_id, name,class,course_id,score,
                    ROW_NUMBER() OVER(PARTITION BY course_id ORDER BY score asc) as rank
               from student) ranked
               where rank <=3''')
print('\n3 sinh viên có điểm thấp nhất theo mã môn học ')
for i in cursor:
    print(i)

3 sinh viên có thứ hạng cao nhất theo mã môn học
(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 1)
(4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2, 1)
(8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8, 2)
(6, 'Dang Thuy Linh', 'May Tinh', 24, 5.5, 1)
(5, 'Vu Quoc Anh', 'May Tinh', 24, 8.0, 2)
(10, 'Cao Thi Hanh', 'May Tinh', 34, 7.0, 1)
(9, 'Duong Huu Phuoc', 'Kinh Te', 34, 7.2, 2)
(3, 'Pham Van Nam', 'Toan Tin', 34, 7.9, 3)

3 sinh viên có điểm thấp nhất theo mã môn học
(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 1)
(4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2, 1)
(8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8, 2)
(6, 'Dang Thuy Linh', 'May Tinh', 24, 5.5, 1)
(5, 'Vu Quoc Anh', 'May Tinh', 24, 8.0, 2)
(10, 'Cao Thi Hanh', 'May Tinh', 34, 7.0, 1)
(9, 'Duong Huu Phuoc', 'Kinh Te', 34, 7.2, 2)
(3, 'Pham Van Nam', 'Toan Tin', 34, 7.9, 3)

# 4. Bổ sung thêm một trường graduation_date có kiểu dữ liệu DATETIME vào bảng student

In [126]:
cursor.execute('''ALTER TABLE student
               ADD graduation_date DATETIME''')

## Tính thời gian tốt nghiệp

In [ ]:
cursor.execute('''CREATE VIEW graduation_ as
                select student_id,name,class,course_id, score,
                    ROW_NUMBER() OVER (ORDER BY score desc) AS rank
               FROM student 
                order by student_id 
               ''')
cursor.execute('''
    UPDATE student
    SET graduation_date = (
        SELECT DATE('now', '+' || rank || ' days')
        FROM graduation_
        WHERE graduation_.student_id = student.student_id
    )
    WHERE student_id IN (SELECT student_id FROM graduation_);
''')
cursor.execute('''select * from student''')
for i in cursor:
    print(i)

(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, '2025-03-21')
(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, '2025-03-13')
(3, 'Pham Van Nam', 'Toan Tin', 34, 7.9, '2025-03-17')
(4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2, '2025-03-18')
(5, 'Vu Quoc Anh', 'May Tinh', 24, 8.0, '2025-03-16')
(6, 'Dang Thuy Linh', 'May Tinh', 24, 5.5, '2025-03-22')
(7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, '2025-03-14')
(8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8, '2025-03-15')
(9, 'Duong Huu Phuoc', 'Kinh Te', 34, 7.2, '2025-03-19')
(10, 'Cao Thi Hanh', 'May Tinh', 34, 7.0, '2025-03-20')